Yuanzjls/Audio_Player_stm32f769disco/Core/Src/main.cpp
/*gif call back functions start */
void screenClearCallback(void)
{
	BSP_LCD_Clear(LCD_COLOR_BLACK);
}
#if 0
void updateScreenCallback(void)
{
	uint32_t xPos = (BSP_LCD_GetXSize() - decoder.GetGifWidth())/2;
	uint32_t yPos = (BSP_LCD_GetYSize() - decoder.GetGifHeight())/2;
	CopyPicture((uint32_t *)IMAGEBUFF_ADDRESS, (uint32_t *)LAYER1_ADDRESS, xPos, yPos, decoder.GetGifWidth(), decoder.GetGifHeight());
}
void drawPixelCallback(int16_t x, int16_t y, uint8_t red, uint8_t green, uint8_t blue)
{
	*((uint32_t*)(IMAGEBUFF_ADDRESS+(x+y* (decoder.GetGifWidth()))*4)) = ((uint16_t)red << 16) | ((uint16_t)green << 8) | (blue);
}
#endif
bool fileSeekCallback(unsigned long position) 
{
	if (f_lseek(&fi, position) == FR_OK)
	{
		return true;
	}
	else
	{
		return false;
	}
}

unsigned long filePositionCallback(void) 
{
    return f_tell(&fi);
}
int fileReadCallback(void) 
{
    uint8_t b;
    FRESULT fr;
    UINT ReadLen;
    fr = f_read(&fi, &b, 1, &ReadLen);
    if (fr == FR_OK && ReadLen == 1)
    {
      return b;
    }
    else
    {
      return -1;
    }
}
#define BlockReadSize 512
#define BlockBuffer PatternSearchBuffer
int fileReadBlockCallback(void * buffer, int numberOfBytes) 
{
    uint8_t b;
    FRESULT fr;
    UINT ReadLen;

    fr = f_read(&fi, buffer, numberOfBytes, &ReadLen);
    if (fr == FR_OK)
    {
      return ReadLen;
    }
    else
    {
      return -1;
    }
    
}
/*gif call back functions end */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
uint32_t FrameOffset=0;
const uint16_t block_size = 36864;
uint16_t buff[block_size];
#define PLAY_HEADER          0x2C
bool flag = 0;
uint8_t temp_data[100];
TaskHandle_t xTaskVolume = NULL;
static TaskHandle_t xTaskMusic = NULL;
static TaskHandle_t xTaskGUI = NULL;
static TaskHandle_t xTaskTouchEx = NULL;
static void vTaskVolume(void *pvParameters)
{
  UBaseType_t  priority;
  uint32_t ulNotifiedValue;
  while(1)
  {

	  ulNotifiedValue = xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );

	  {
		  if (ulNotifiedValue & 0x01)
		  priority = uxTaskPriorityGet( NULL );
	              	vTaskPrioritySet(NULL, 0);
	              	wm8994_SetVolume(AUDIO_I2C_ADDRESS, volume);
	              	vTaskPrioritySet(NULL, priority);

	  }
	  BSP_LED_Toggle(LED2);
    //vTaskDelay(400);
  }
}
static void vTaskTouchEx(void *pvParameters)
{
	volatile uint32_t ulNotificationValue;
	TS_StateTypeDef  ts;
	static volatile GUI_PID_STATE TS_State = {0, 0, 0, 0};



	while(1)
	{
		ulNotificationValue = ulTaskNotifyTake( pdTRUE, 50 );


		if (ulNotificationValue==1)
		{
			BSP_TS_GetState((TS_StateTypeDef *)&ts);
			TS_State.Pressed = 1;
			TS_State.x = ts.touchX[0];
			TS_State.y = ts.touchY[0];
			GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);
		}
		else
		{
			if (TS_State.Pressed == 1)
			{
				TS_State.Pressed = 0;
				TS_State.x = -1;
				TS_State.y = -1;
				GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);;
			}
		}

	}
}
unsigned int RetrieveMP3Data(void * pMP3CompressedData,
unsigned int nMP3DataSizeInChars,
void * token)
{
	UINT nData_Read;

	f_read((FIL*)token, pMP3CompressedData, nMP3DataSizeInChars, &nData_Read);
	return nData_Read;
}



static void vTaskMusic(void *pvParameters)
{
  FRESULT fr;
  DIR dj;
  FILINFO fno;
  FATFS fs;
  unsigned int length=0;
  uint32_t ulNotifiedValue;

  if (f_mount(&fs,(char*)"",1) == FR_OK)
  {
	fr = f_findfirst(&dj, &fno, "", "*.wav");
	if (fr == FR_OK && fno.fname[0])
	{
		f_open(&fi, fno.fname, FA_READ);
		f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
		f_lseek(&fi, PLAY_HEADER);
		f_read(&fi, buff, block_size*2, &length);
		Playback_Init(Wheader.Samplerate);
		HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
        while(1)
        {
          xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
          if (ulNotifiedValue)
          {
            if (ulNotifiedValue  & 0x01)
            {
              f_read(&fi, &buff[block_size/2], block_size, &length);
            }   
            if (ulNotifiedValue  & 0x02)
            {
              f_read(&fi, &buff[0], block_size, &length);
            }
            if (f_tell(&fi) == f_size(&fi))
            {
            	fr = f_findnext(&dj, &fno);
            	if (fr == FR_OK && fno.fname[0])
            	{
            		f_open(&fi, fno.fname, FA_READ);
					f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
					f_lseek(&fi, PLAY_HEADER);
					f_read(&fi, buff, block_size*2, &length);
					wm8994_SetFrequency(AUDIO_I2C_ADDRESS, Wheader.Samplerate);
            	}
            	else
            	{
            		fr = f_findfirst(&dj, &fno, "", "*.wav");
            	}
            }
            BSP_LED_Toggle(LED_RED);
          }
        }
	}

  }
}
//void vTimerLEDCallback(TimerHandle_t xTimer)
//{
//	BSP_LED_Toggle(LED3);
//}

void  vTaskGUI(void *pvParameters)
{
	MainTask();
}
//higher number, higher priority
static void AppTaskCreate(void)
{
  xTaskCreate(vTaskVolume, "TaskVolume", 512, NULL, 3, &xTaskVolume);
  xTaskCreate(vTaskMusic, "TaskMusic", 1024, NULL, 4, &xTaskMusic);
  xTaskCreate(vTaskGUI, "TaskGUI", 1024, NULL, 1, &xTaskGUI);
  xTaskCreate(vTaskTouchEx, "TaskTouchEx", 512, NULL, 2, &xTaskTouchEx);

  //xTimerStart(xTimerCreate("Timer", 600, pdTRUE, (void *) 0, vTimerLEDCallback), 0);
}
static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU as Normal Non Cacheable for the SRAM1 and SRAM2 */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x20020000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */
	

